Reports/ABC_АнализПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ABC_АнализПокупателей</Name>
			<Comment>ABC анализ покупателей</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Comment>Объект формирования отчета</Comment>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыводаОтчета</Name>
					<Comment>Режим отображения: табличный документ, сводная таблица, диаграмма</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыводаОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРегистра</Name>
					<Comment>Имя регистра для запроса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимНастройки</Name>
					<Comment>Режим настройки отчета: стандарт, эксперт</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыНастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормыНастроек</Name>
					<Comment>Текущее имя формы настроек</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Comment>Вид отчета: обороты, остатки, остатки и обороты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакетаОформленияТабличногоДокумента</Name>
					<Comment>Имя макета оформления табличного документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДополнительныеПоляВОтдельнойКолонке</Name>
					<Comment>Выводить дополнительные группировок в отдельной колонке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
					<Comment>Сохраненные настройки отчета</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыИзмеренийСтрок</Name>
					<Comment>Параметры измерений строк</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаА</Name>
					<Comment>Группа А</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаВ</Name>
					<Comment>Группа В</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаС</Name>
					<Comment>Группа С</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Comment>Порядок сортировки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбТипДиаграммы</Name>
					<Comment>Тип отображения диаграммы</Comment>
					<Type>
						<v8:Type>v8ui:ChartType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАвтоотступ</Name>
					<Comment>Использовать автоотступ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
					<Comment>Показатели отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования показателя</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматнаяСтрока</Name>
							<Comment>Форматная строка отображения показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Положение</Name>
							<Comment>Положение показателя в табличном документе</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ПоложенияПоказателяТабличногоДокумента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаКолонки</Name>
							<Comment>Ширина колонки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Функции</Name>
					<Comment>Функции отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя функции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление функции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования функции</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияСтроки</Name>
					<Comment>Измерения строки</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования измерения строк</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Comment>Путь к данным измерения строк</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление измерения строк</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Comment>Тип измерения строк</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияКолонки</Name>
					<Comment>Измерения колонки</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования измерения колонок</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Comment>Путь к данным измерения колонок</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление измерения колонок</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Comment>Тип измерения колонки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ABC_АнализПокупателей/Ext/ObjectModule.bsl
#Если Клиент Тогда
// Модуль отчета

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем ТекстЗапроса Экспорт;                            // Хранит текст запроса отчета
Перем ПараметрыИспользованияПолейИПоказателей Экспорт; // Хранит параметры использования полей  показателей
Перем ДеревоДоступныхПолей Экспорт;                    // Хранит дерево доступных полей отчета
Перем СтруктураСвязиСвойств Экспорт;                   // Хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                  // Хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;         // Хранит структуру не связанных показателей
Перем ДополнительныеПоляОтчета Экспорт;                // Хранит дополнительные поля отчета
Перем мСортировка Экспорт;                             // Возможные сортировки
Перем СтруктураИтоговыхВыраженийПоказателей Экспорт;   // Хранит итоговые выражения показателей отчета
	
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА
	
// Стандартная процедура настройки построителя отчета 
//
// Параметры
//  ИмяМакета  – строка – имя макета
//  ИмяМакетаПараметров  – строка – имя макета параметров
//  
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета, ИмяМакетаПараметров="Параметры") Экспорт
		
	// Заполним структуру параметров
	СтруктураПараметрыЗаполнения = Новый Структура();
	СтруктураПараметрыЗаполнения.Вставить("ОтчетОбъект",            ЭтотОбъект);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаТекстаЗапроса", ИмяМакета);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаПараметров",    ИмяМакетаПараметров);
	отЗаполнитьНачальныеНастройки(СтруктураПараметрыЗаполнения, глПрава);
		
	ПостроительОтчета.Параметры.Вставить("ГруппаА");
	ПостроительОтчета.Параметры.Вставить("ГруппаВ");
	ПостроительОтчета.Параметры.Вставить("ГруппаС");
		
КонецПроцедуры	//	ЗаполнитьНачальныеНастройки()

// Формирует таблицу источника данных
Функция ПолучитьТаблицуИсточникаДанных(ТекПостроитель, ТаблицаВывода, СтруктураКолонок) Экспорт

	КоличествоИзмерений = 2;
	ТекПостроитель.ИзмеренияСтроки.Добавить("Покупатель");	
	Выборка = ТекПостроитель.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,ТекПостроитель.ИзмеренияСтроки[1].ПутьКДанным, "Все");
	
	ВсегоСумма = 0;
	Пока Выборка.Следующий() Цикл
		ВсегоСумма = ВсегоСумма+Выборка[Сортировка];
	КонецЦикла;
		
	Выборка.Сбросить();
	Если ВсегоСумма<0 Тогда
		ВсегоСумма=-ВсегоСумма;
	КонецЕсли;
	ПорогА = Окр((ВсегоСумма*ГруппаА/100),2);
	ПорогВ = Окр((ВсегоСумма*ГруппаВ/100),2);
	ГраницаПорогаВ = ПорогА + ПорогВ;
		
	НакопленнаяСумма = 0;
	
	СтруктураВычисляемыхПоказателей = Новый Структура ("КоэффициентВариации, Доля");
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число", , ,Новый КвалификаторыЧисла(15,2));
	СтруктураНеобходимыхПоказателей = Новый Структура ("СебестоимостьУпр, СуммаУпр");
	Для Каждого ТекНужныйПоказатель Из СтруктураНеобходимыхПоказателей Цикл
		Если ТаблицаВывода.Колонки.Найти(ТекНужныйПоказатель.Ключ) = Неопределено Тогда
			ТаблицаВывода.Колонки.Добавить(ТекНужныйПоказатель.Ключ, ОписаниеТиповЧисло);
		КонецЕсли;
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл
		ТекСуммаПараметра = Выборка[Сортировка];
		НакопленнаяСумма = НакопленнаяСумма + ТекСуммаПараметра;
		Если НакопленнаяСумма <= ПорогА ИЛИ ПорогА < ТекСуммаПараметра Тогда
			ТекABCГруппа = "Группа А";
		ИначеЕсли НакопленнаяСумма <= ГраницаПорогаВ ИЛИ ПорогВ < ТекСуммаПараметра Тогда
			ТекABCГруппа = "Группа В";
		Иначе
			ТекABCГруппа = "Группа С";
		КонецЕсли;
			
		Если 1<КоличествоИзмерений Тогда
			ПолучитьДеревоРезультата(Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией), 1, ТаблицаВывода, ТекABCГруппа);
		Иначе
			НоваяСтрока = ТаблицаВывода.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.ABCГруппа = ТекABCГруппа;
		КонецЕсли;
	КонецЦикла;
		
	ЕстьДоля = Показатели.Найти("Доля", "Имя").Использование;
	Если ЕстьДоля Тогда
		ТаблицаВывода.Колонки.Добавить("ИтоговаяСуммаСортировки", Новый ОписаниеТипов("Число", , ,Новый КвалификаторыЧисла(15,3)));
		ТаблицаВывода.ЗаполнитьЗначения(ВсегоСумма, "ИтоговаяСуммаСортировки");
	КонецЕсли;
		
	Возврат ТаблицаВывода;
КонецФункции

// Формирует дерево результата
Процедура ПолучитьДеревоРезультата(Выборка, Знач Индекс, ТаблицаРезультата, ТекАВСГруппа);
		
	Инд = Индекс+1;
	Пока Выборка.Следующий() Цикл
		Если Инд < 2 Тогда
			ПолучитьДеревоРезультата(Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией), Инд, ТаблицаРезультата, ТекАВСГруппа);
		Иначе
			НоваяСтрока = ТаблицаРезультата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.ABCГруппа = ТекАВСГруппа;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры // ПолучитьДеревоРезультата()

// формирует отчет в виде табличного документа и возвращает его в качестве результата
//
// Параметры
//  ДокументРезультат – ТабличныйДокумент или ПолеТабличногоДокумента – передает ссылку на табличный документ 
//						или поле табличного документа
//
// Возвращаемое значение:
//  отчет в виде табличного документа 
//
Функция СформироватьТабличныйДокумент(ДокументРезультат=Неопределено) Экспорт
	
	Показатель = Показатели.Найти(Сортировка, "Имя");
	Показатель.Использование = Истина;
    СтруктураИтоговыхВыраженийПоказателей.Вставить("Доля", СтрЗаменить(СтруктураИтоговыхВыраженийПоказателей["Доля"], "ВыбСуммаСортировки", Сортировка));
	
	Результат = отСформироватьТабличныйДокумент(ЭтотОбъект, ДокументРезультат, 1, глПрава);
	Возврат Результат;
	
КонецФункции // СформироватьТабличныйДокумент()

// формирует структуру сортировки
// Возвращает список значений с сортировками
Функция СтруктураСортировки() Экспорт
	
	Если СокрЛП(Сортировка) = "" Тогда
		СписокСортировки = Неопределено;
	Иначе
		СписокСортировки = Новый СписокЗначений();
		СписокСортировки.Добавить(НаправлениеСортировки.Возр, "ABCГруппа");
		
		СписокСортировки.Добавить(НаправлениеСортировки.Убыв, Сортировка);
	КонецЕсли;
		
	Возврат СписокСортировки;
 	
КонецФункции

	
// формирует диаграмму и возвращает её 
//
// Параметры
//  ПолеДиаграммы – диаграмма -  содержит диаграмму
//  СтруктураПараметров - структура - передает структуру параметров диаграммы
//
// Возвращаемое значение:
//  поле диаграммы 
//
Функция СформироватьДиаграмму(ПолеДиаграммы=Неопределено, СтруктураПараметров=Неопределено) Экспорт
	
	Показатель = Показатели.Найти(Сортировка, "Имя");
	Показатель.Использование = Истина;
	
	СтруктураИтоговыхВыраженийПоказателей.Вставить("Доля", СтрЗаменить(СтруктураИтоговыхВыраженийПоказателей["Доля"], "ВыбСуммаСортировки", Сортировка));

	отСформироватьДиаграмму(ЭтотОбъект, ПолеДиаграммы, СтруктураПараметров,1);
		
	Возврат ПолеДиаграммы;
		
КонецФункции // СформироватьДиаграмму()
	
// Функция возвращает структуру форматирования полей
//
// Без параметров
//  
// Возвращаемое значение:
//  СтруктураФорматаПолей - структура 
//
Функция СтруктураФорматированияПолей() Экспорт
		
	СтруктураФорматаПолей = Новый Структура;
	отСтруктураФорматированияПолей(ЭтотОбъект, СтруктураФорматаПолей);
		
	// Если необходимо, добавим другие или переустановим строки форматирования полей
		
	Возврат СтруктураФорматаПолей;
		
КонецФункции	//	СтруктураФорматированияПолей()
	
//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
	
мСортировка = Новый СписокЗначений;
мСортировка.Добавить("СуммаРегл", "Сумма продаж (Регл.)");
мСортировка.Добавить("СуммаУпр", "Сумма продаж (Упр.)");
мСортировка.Добавить("Количество", "Количество (в базовых ед.)");
мСортировка.Добавить("СуммаНаценкиРегл", "Сумма наценки (Регл.)");
мСортировка.Добавить("СуммаНаценкиУпр", "Сумма наценки (Упр.)");
мСортировка.Добавить("ПроцентНаценки", "Процент наценки");

ГруппаА = 75;
ГруппаВ = 20;
ГруппаС = 5;
	
Сортировка = мСортировка[0].Значение;
	
ИмяРегистра = "Продажи";
отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
ПромежуточныеЗначенияПостроителя = Новый Структура();
СтруктураНеСвязанныхПоказателей = Новый Структура();
СтруктураИтоговыхВыраженийПоказателей = Новый Структура();
#КонецЕсли
